****************************************************************
*    顧客名　　　　　　　：　（株）サカタのタネ殿　　　　　　　*
*    サブシステム　　　　：　出荷業務　　　　　　　　　　　　　*
*    業務名　　　　　　　：　業務改善                          *
*    モジュール名　　　　：　ＡＣＣＥＰＴ画面表示　　　　　    *
*    作成日／更新日　　　：　2011/04/19                        *
*    作成者／更新者　　　：　ＮＡＶ高橋　　　　　　　　　　　　*
*    処理概要　　　　　　：　ＡＣＣＥＰＴ画面を表示する。　　　*
*　　更新日／更新者　　　：                                    *
*　                                                            *
****************************************************************
 IDENTIFICATION         DIVISION.
*
 PROGRAM-ID.            SKZ0090B.
 AUTHOR.                NAV.
 DATE-WRITTEN.          11/04/19.
 ENVIRONMENT            DIVISION.
 CONFIGURATION          SECTION.
 SPECIAL-NAMES.
         CONSOLE   IS   CONS.
 INPUT-OUTPUT           SECTION.
 FILE-CONTROL.
*
****************************************************************
 DATA                   DIVISION.
****************************************************************
 FILE                   SECTION.
*--------------------------------------------------------------*
 WORKING-STORAGE        SECTION.
*--------------------------------------------------------------*
 01  FLAGS.
     03  END-FLG        PIC  X(03)     VALUE  SPACE.
*----<< ﾜｰｸ ｴﾘｱ >>--*
 01  WK-CHK             PIC  9(01)     VALUE  ZERO.
*
 01  LINK-AREA2.
     03  LINK-IN-KBN    PIC  X(01).
     03  LINK-IN-YMD6   PIC  9(06).
     03  LINK-IN-YMD8   PIC  9(08).
     03  LINK-OUT-RET   PIC  X(01).
     03  LINK-OUT-YMD8  PIC  9(08).
*
****************************************************************
 PROCEDURE              DIVISION.
****************************************************************
*--------------------------------------------------------------*
*    LEVEL 0        エラー処理　　　　　　　　　　　　　　　　 *
*--------------------------------------------------------------*
 DECLARATIVES.
 END DECLARATIVES.
****************************************************************
*　　　　メインモジュール　　　　　　　　　　　　　　　　　　　*
****************************************************************
 PROG-CNTL              SECTION.
*ＡＣＣＥＰＴメッセージ出力
     DISPLAY NC"本日の出荷業務の確認を実施願います！"
             NC"出荷完了の入力を忘れずに実施して下さい。"
             UPON CONS.
*
     ACCEPT  WK-CHK  FROM CONS.
     STOP RUN.
 PROG-CNTL-EXIT.
     EXIT.
*-----------------<< PROGRAM END >>----------------------------*
